correccion de wereframes y diagramas
